notes.org
#+title: BIOSTAT 615 Notes
#+description: Organization File For BIOSTATS 615 @ The University of Michigan, Ann Arbor
#+author: Pete Pritchard
#+LANGUAGE:  en
#+STARTUP:   content showstars indent inlineimages hideblocks
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="custom.css"/>
#+OPTIONS:   toc:2 html-scripts:nil num:nil html-postamble:nil html-style:nil ^:nil
* Course Logistics

** Class Times:

- M/W 8:30am-10am, 1690 SPH I

** Intructor: Hyun Ming Kan

- email: hmkang@umich.edu
- Office Hours:
  - Monday 9:50am - 10:30am, 4623 SPH I Tower
  - Wednesday 9:50am - 10:30am, 4623 SPH I Tower

** GSI: Longhao Pang

- email: lhpang@umich.edu
- Office Hours:
  - Tuesday 3-4:30 M4117 SPH II

* Important Dates
** DONE Topic 0 Review Quiz Due
SCHEDULED: <2024-08-28 Wed>
** DONE Learning Exercise #1
SCHEDULED: <2024-09-03 Tue>
** DONE Learning Exercise #2, Mastery Assigment #1
SCHEDULED: <2024-09-10 Tue>
** TODO Group Project Proposals
SCHEDULED: <2024-10-11 Fri>
** TODO Group Project Progress Reporto
SCHEDULED: <2024-11-08 Fri>
** TODO Midterm Exam
SCHEDULED: <2024-11-25 Mon>
** TODO Final Project Presentation Slides
SCHEDULED: <2024-12-03 Tues>
** TODO Final Project Presentations 1
SCHEDULED: <2024-12-04 Wed>
** TODO Final Project Presentations 2
SCHEDULED: <2024-12-09 Mon>
** TODO Final Report and Software Package
SCHEDULED: <2024-12-13>

* Lecture 1 08-26

** Primarily a couse logistics and syllabus overview.

* Lecture 2 8-28 | Numerical Precision and Relative Error

** Computer representation of numbers

- Computer operations must work with representation of numbers that accomplished by transitors
  - Transitor: a miniature semiconductor that regulates or controls current or voltage flow in addition to amplifying and generating these eletrical signals and acting as as switch/gate for them
  - CPU and RAM
  - Amount of information that can be stored is limited by the amount of size of transitor (storage)
- Two possible states: *off* and *on*
- Number of transitors is finite... can be up to a billion
- To manage overall memory effectively,
  - Restrict the amount of memory that can be allocated to different kinds of numbers
- In the decimal system, numerical values are represented in units or powers of 10
- For a nonnegative integer /k/
  \[
  k = \sum{j=0}{m}a_{j}(10)^{j}, k = (a_{m}a_{m-1} \dots a_{0})_{10}
  \]
  where
- For example,

#+begin_src R
intToBits(127)
intToBits(128)
#+end_src

#+RESULTS:

** Bit and Byte

- *Bit*: the basic unit of information in computing and digital communications
- *Byte*: a unit of storing digital information in memory, consisting of *eight bits*
 op- The connection between *machine memory* and *computer arithmetic*:
  - Bits <-> Transitors, Bytes <-> Blocks of 8 Transitors
- Integer in memory:
  - Binary representation created by:
    - allocating it a block of memory
    - idenifying the individual transitors in the block with a power 2 from its binary representation
    - turning on those transitors that correspond to powers of 2 that have unit (1) coefficients
  - Let's look at *2024* again
    - We need *11* bits to hold integer *2024*
    - *11* bits are needed, so *1* byte is not enough, at least *2* bytes
- More on bytes:
  - A document, image, movie,... how many bytes?
  - *1* byte can hold a letter / character
    - KB = 1 thousand bytes
    - MB = 1 million bytes
    - GB = 1 billion bytes
    - TB = 1 trillion bytes
    - PB = 1 quadrillion bytes

#+begin_src R
s = 2000000000

print(s)

print(s+s)

# What do you expect to be printed?
#+end_src

#+begin_src R
s = 2000000000L

print(s)

print(s+s)

# What do you expect to be printed?
#+end_src

#+begin_src R
noquote(format(.Machine))
#+end_src

- .Machine contains a list of machine precision and limit values
- format(.) displays a list in a tabular format string
- noquote(.)

