notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-01 Tue 20:27 -->
<meta charset="UTF-8">
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>BIOSTAT 615 Notes</title>
<meta name="author" content="Pete Pritchard" />
<meta name="description" content="Organization File For BIOSTATS 615 @ The University of Michigan, Ann Arbor" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="custom.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">BIOSTAT 615 Notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org249c8be">Course Logistics</a>
<ul>
<li><a href="#org0243816">Class Times:</a></li>
<li><a href="#orgd2012dd">Intructor: Hyun Ming Kan</a></li>
<li><a href="#org0dc4c95">GSI: Longhao Pang</a></li>
</ul>
</li>
<li><a href="#orgfa4d5ba">Important Dates</a>
<ul>
<li><a href="#org45d0834"><span class="done DONE">DONE</span> Topic 0 Review Quiz Due</a></li>
<li><a href="#org197c3b9"><span class="done DONE">DONE</span> Learning Exercise #1</a></li>
<li><a href="#org749ebb6"><span class="done DONE">DONE</span> Learning Exercise #2, Mastery Assigment #1</a></li>
<li><a href="#org1df2a33"><span class="todo TODO">TODO</span> Group Project Proposals</a></li>
<li><a href="#orge127cd6"><span class="todo TODO">TODO</span> Group Project Progress Reporto</a></li>
<li><a href="#orgd5df3d7"><span class="todo TODO">TODO</span> Midterm Exam</a></li>
<li><a href="#org8fe9a18"><span class="todo TODO">TODO</span> Final Project Presentation Slides</a></li>
<li><a href="#orgef6381a"><span class="todo TODO">TODO</span> Final Project Presentations 1</a></li>
<li><a href="#orga80a337"><span class="todo TODO">TODO</span> Final Project Presentations 2</a></li>
<li><a href="#orgd49b562"><span class="todo TODO">TODO</span> Final Report and Software Package</a></li>
</ul>
</li>
<li><a href="#orgd42f13f">Lecture 1 08-26</a>
<ul>
<li><a href="#org1470e47">Primarily a couse logistics and syllabus overview.</a></li>
</ul>
</li>
<li><a href="#org7b1620d">Lecture 2 8-28 | Numerical Precision and Relative Error</a>
<ul>
<li><a href="#orgf4ce10b">Computer representation of numbers</a></li>
<li><a href="#orgf266e0a">Bit and Byte</a></li>
<li><a href="#org3399cb1">R Storage</a></li>
<li><a href="#orgfce2bfc">Floating point representation</a></li>
<li><a href="#orge467ce5">Errors</a></li>
</ul>
</li>
<li><a href="#org25b7d41">Lecture 3 9-04 | Numerical Precision and Relatove Error Cont.</a>
<ul>
<li><a href="#org718822a">Quick notes:</a></li>
<li><a href="#orga6a3ad0">Precision errors with quadratic equation</a></li>
<li><a href="#orga387233">West Algorithm</a></li>
</ul>
</li>
<li><a href="#orge255f80">Lecture 4 9-09 | Divide &amp; Conquer</a>
<ul>
<li><a href="#org675b65f">Time Complexity</a></li>
<li><a href="#org1bc18ff">Recursion</a></li>
<li><a href="#org17e4b13">Divide and Conquer Algorithm</a></li>
</ul>
</li>
<li><a href="#org66dfc21">Lecture 5 | Matrix Computation</a>
<ul>
<li><a href="#orgb2d42b8">Algorithms for matrix computation</a></li>
</ul>
</li>
<li><a href="#orgf12643c">Lecture 6 | Matrix Computation cont.</a>
<ul>
<li><a href="#orgf6100b3">BLAS/LAPACK</a></li>
<li><a href="#org905da41">Quadratic multiplication</a></li>
<li><a href="#org5202d6e">Matrix decompisition and solving linear systems</a></li>
</ul>
</li>
<li><a href="#orgce65f82">Assignments:</a>
<ul>
<li><a href="#orgbc2d9cd">Learning Ex. 1:</a></li>
<li><a href="#org6566acb">Code</a></li>
<li><a href="#org09de879">Learning Ex. 2:</a></li>
<li><a href="#orgd81c1a9">Code</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org249c8be" class="outline-2">
<h2 id="org249c8be">Course Logistics</h2>
<div class="outline-text-2" id="text-org249c8be">
</div>
<div id="outline-container-org0243816" class="outline-3">
<h3 id="org0243816">Class Times:</h3>
<div class="outline-text-3" id="text-org0243816">
<ul class="org-ul">
<li>M/W 8:30am-10am, 1690 SPH I</li>
</ul>
</div>
</div>
<div id="outline-container-orgd2012dd" class="outline-3">
<h3 id="orgd2012dd">Intructor: Hyun Ming Kan</h3>
<div class="outline-text-3" id="text-orgd2012dd">
<ul class="org-ul">
<li>email: hmkang@umich.edu</li>
<li>Office Hours:
<ul class="org-ul">
<li>Monday 9:50am - 10:30am, 4623 SPH I Tower</li>
<li>Wednesday 9:50am - 10:30am, 4623 SPH I Tower</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0dc4c95" class="outline-3">
<h3 id="org0dc4c95">GSI: Longhao Pang</h3>
<div class="outline-text-3" id="text-org0dc4c95">
<ul class="org-ul">
<li>email: lhpang@umich.edu</li>
<li>Office Hours:
<ul class="org-ul">
<li>Tuesday 3-4:30 M4117 SPH II</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfa4d5ba" class="outline-2">
<h2 id="orgfa4d5ba">Important Dates</h2>
<div class="outline-text-2" id="text-orgfa4d5ba">
</div>
<div id="outline-container-org45d0834" class="outline-3">
<h3 id="org45d0834"><span class="done DONE">DONE</span> Topic 0 Review Quiz Due</h3>
<div class="outline-text-3" id="text-org45d0834">
</div>
</div>
<div id="outline-container-org197c3b9" class="outline-3">
<h3 id="org197c3b9"><span class="done DONE">DONE</span> Learning Exercise #1</h3>
<div class="outline-text-3" id="text-org197c3b9">
</div>
</div>
<div id="outline-container-org749ebb6" class="outline-3">
<h3 id="org749ebb6"><span class="done DONE">DONE</span> Learning Exercise #2, Mastery Assigment #1</h3>
<div class="outline-text-3" id="text-org749ebb6">
</div>
</div>
<div id="outline-container-org1df2a33" class="outline-3">
<h3 id="org1df2a33"><span class="todo TODO">TODO</span> Group Project Proposals</h3>
<div class="outline-text-3" id="text-org1df2a33">
</div>
</div>
<div id="outline-container-orge127cd6" class="outline-3">
<h3 id="orge127cd6"><span class="todo TODO">TODO</span> Group Project Progress Reporto</h3>
<div class="outline-text-3" id="text-orge127cd6">
</div>
</div>
<div id="outline-container-orgd5df3d7" class="outline-3">
<h3 id="orgd5df3d7"><span class="todo TODO">TODO</span> Midterm Exam</h3>
<div class="outline-text-3" id="text-orgd5df3d7">
</div>
</div>
<div id="outline-container-org8fe9a18" class="outline-3">
<h3 id="org8fe9a18"><span class="todo TODO">TODO</span> Final Project Presentation Slides</h3>
<div class="outline-text-3" id="text-org8fe9a18">
</div>
</div>
<div id="outline-container-orgef6381a" class="outline-3">
<h3 id="orgef6381a"><span class="todo TODO">TODO</span> Final Project Presentations 1</h3>
<div class="outline-text-3" id="text-orgef6381a">
</div>
</div>
<div id="outline-container-orga80a337" class="outline-3">
<h3 id="orga80a337"><span class="todo TODO">TODO</span> Final Project Presentations 2</h3>
<div class="outline-text-3" id="text-orga80a337">
</div>
</div>
<div id="outline-container-orgd49b562" class="outline-3">
<h3 id="orgd49b562"><span class="todo TODO">TODO</span> Final Report and Software Package</h3>
<div class="outline-text-3" id="text-orgd49b562">
</div>
</div>
</div>
<div id="outline-container-orgd42f13f" class="outline-2">
<h2 id="orgd42f13f">Lecture 1 08-26</h2>
<div class="outline-text-2" id="text-orgd42f13f">
</div>
<div id="outline-container-org1470e47" class="outline-3">
<h3 id="org1470e47">Primarily a couse logistics and syllabus overview.</h3>
</div>
</div>
<div id="outline-container-org7b1620d" class="outline-2">
<h2 id="org7b1620d">Lecture 2 8-28 | Numerical Precision and Relative Error</h2>
<div class="outline-text-2" id="text-org7b1620d">
</div>
<div id="outline-container-orgf4ce10b" class="outline-3">
<h3 id="orgf4ce10b">Computer representation of numbers</h3>
<div class="outline-text-3" id="text-orgf4ce10b">
<ul class="org-ul">
<li>Computer operations must work with representation of numbers that accomplished by transitors
<ul class="org-ul">
<li>Transitor: a miniature semiconductor that regulates or controls current or voltage flow in addition to amplifying and generating these eletrical signals and acting as as switch/gate for them</li>
<li>CPU and RAM</li>
<li>Amount of information that can be stored is limited by the amount of size of transitor (storage)</li>
</ul></li>
<li>Two possible states: <b>off</b> and <b>on</b></li>
<li>Number of transitors is finite&#x2026; can be up to a billion</li>
<li>To manage overall memory effectively,
<ul class="org-ul">
<li>Restrict the amount of memory that can be allocated to different kinds of numbers</li>
</ul></li>
<li>In the decimal system, numerical values are represented in units or powers of 10</li>
<li>For a nonnegative integer <i>k</i>
\[
  k = \sum{j=0}{m}a_{j}(10)^{j}, k = (a_{m}a_{m-1} \dots a_{0})_{10}
  \]
where</li>
<li>For example,</li>
</ul>

<div class="org-src-container">
<pre class="src src-R">intToBits(<span style="color: #f3f99d; font-weight: bold;">127</span>)
intToBits(<span style="color: #f3f99d; font-weight: bold;">128</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf266e0a" class="outline-3">
<h3 id="orgf266e0a">Bit and Byte</h3>
<div class="outline-text-3" id="text-orgf266e0a">
<ul class="org-ul">
<li><b>Bit</b>: the basic unit of information in computing and digital communications</li>
<li><b>Byte</b>: a unit of storing digital information in memory, consisting of <b>eight bits</b>
op- The connection between <b>machine memory</b> and <b>computer arithmetic</b>:
<ul class="org-ul">
<li>Bits &lt;-&gt; Transitors, Bytes &lt;-&gt; Blocks of 8 Transitors</li>
</ul></li>
<li>Integer in memory:
<ul class="org-ul">
<li>Binary representation created by:
<ul class="org-ul">
<li>allocating it a block of memory</li>
<li>idenifying the individual transitors in the block with a power 2 from its binary representation</li>
<li>turning on those transitors that correspond to powers of 2 that have unit (1) coefficients</li>
</ul></li>
<li>Let&rsquo;s look at <b>2024</b> again
<ul class="org-ul">
<li>We need <b>11</b> bits to hold integer <b>2024</b></li>
<li><b>11</b> bits are needed, so <b>1</b> byte is not enough, at least <b>2</b> bytes</li>
</ul></li>
</ul></li>
<li>More on bytes:
<ul class="org-ul">
<li>A document, image, movie,&#x2026; how many bytes?</li>
<li><b>1</b> byte can hold a letter / character
<ul class="org-ul">
<li>KB = 1 thousand bytes</li>
<li>MB = 1 million bytes</li>
<li>GB = 1 billion bytes</li>
<li>TB = 1 trillion bytes</li>
<li>PB = 1 quadrillion bytes</li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-R">s = <span style="color: #f3f99d; font-weight: bold;">2000000000</span>

print(s)

print(s+s)

<span style="color: #606580;"># </span><span style="color: #606580;">What do you expect to be printed?</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">s = 2000000000L

print(s)

print(s+s)

<span style="color: #606580;"># </span><span style="color: #606580;">What do you expect to be printed?</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">noquote(format(.Machine))
</pre>
</div>

<ul class="org-ul">
<li>.Machine contains a list of machine precision and limit values</li>
<li>format(.) displays a list in a tabular format string</li>
<li>noquote(.)</li>
</ul>
</div>
</div>
