notes.org
** R Storage

- Primative data types in R
  1. character: 8 bytes
  2. double: numeric: 8 bytes
  3. integer: 4 bytes
  4. logical: 4 bytes

- The most basic data structure in *R* is an array comprised of one of the primitive data types that is referred to as an /atomic vector/
- Use the *storage.mode* to access the storage mode of a given object
- Use the *object.size* to obtain the memory allocation of an R object
- Machine specific detauls cocnerning storage, etc. are held in the *R* list variable *.machine*

** Floating point representation

- *Q*: Can a computer precisely store an irrational number? Why?
  - *A*: There is a limit to the precision that can be acheived.

** Errors

*** Relative erros in double precision

- Upper bound of relative erross: /(/ 2^{-(m+1)} ) where /m/ is the signficand bits
- For relative precision (double) /m/ = 52
- The relative error of double precision is
  \begin{equation}

  \end{equation}


* Lecture 3 9-04 | Numerical Precision and Relatove Error Cont.

** Quick notes:

- For the mastery assignements there will be no test cases to check like with the learning asssignments
- However, there will be a google collab file that will help you test and debug
- Unlimited submissions just like learning assignment

** Precision errors with quadratic equation

- The challange: (/ | 4b_{2}b_{0} | << b^{2}_{2} /)
- Not accurate in terms in relative error in some cases

** West Algorithm

*** Algorithms (def)

- loose definition: a sequence of well-defined computational steps
- takes a set of values
- produces a set of values

*** Key features of a good algorithm

- Correctness
- Efficiency
- Simplicity

***

* Lecture 4 9-09 | Divide & Conquer

** Time Complexity

- Why is it important?
  - Suppose that I have an algoroithm that takes 1 second for n=1000 sample size
  - If the algorithm has linear time complexity....
    - 1 million, 17 minutes
    - 1 billion, 12 days....
  - If the algorithm has quadratic time complexity...
    - 50000 samples, 42 minutes
    - 1 million samples, 12 days
    - 1 billion, 31000 years
  - In log time complexity...
    - For 1 billion samples, 20 seconds

- Big O notation (upper bounded)
  - This is what we care abou the most... worst case performance
- Big Omega notation (lower bounded)
- Big Theta notation (tight bound)
  - For most of this class, we will use Big Theta notation

** Recursion

- Key components
  - A function that is part of its own definition
  - Terminating condition

- Tower of Hanoi

** Divide and Conquer Algorithm

- Solve a problem recursively, applying three steps at each level of recursion

  1. *Divide*: the problem into a number of subproblems that are smaller instances of the same problem
  2. *Conquer*: the subproblems by solving them recursively. If the subproblem sizes are small enough, however, just solve the problems in a straightforward manner
  3. *Combine*: the solutions to subproblems into the solution for the original problem

*** Insertion Sort

- For k-th step, assume that elements a[1], ... , a[k-1] are already sorted in order.
- Locate a[k] between index 1, ... ,k so that all a[1], ..., a[k] are in order
- Move the focus to k+1-th element and repeat the same step


