notes.html
<div id="outline-container-org3399cb1" class="outline-3">
<h3 id="org3399cb1">R Storage</h3>
<div class="outline-text-3" id="text-org3399cb1">
<ul class="org-ul">
<li>Primative data types in R
<ol class="org-ol">
<li>character: 8 bytes</li>
<li>double: numeric: 8 bytes</li>
<li>integer: 4 bytes</li>
<li>logical: 4 bytes</li>
</ol></li>

<li>The most basic data structure in <b>R</b> is an array comprised of one of the primitive data types that is referred to as an <i>atomic vector</i></li>
<li>Use the <b>storage.mode</b> to access the storage mode of a given object</li>
<li>Use the <b>object.size</b> to obtain the memory allocation of an R object</li>
<li>Machine specific detauls cocnerning storage, etc. are held in the <b>R</b> list variable <b>.machine</b></li>
</ul>
</div>
</div>
<div id="outline-container-orgfce2bfc" class="outline-3">
<h3 id="orgfce2bfc">Floating point representation</h3>
<div class="outline-text-3" id="text-orgfce2bfc">
<ul class="org-ul">
<li><b>Q</b>: Can a computer precisely store an irrational number? Why?
<ul class="org-ul">
<li><b>A</b>: There is a limit to the precision that can be acheived.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge467ce5" class="outline-3">
<h3 id="orge467ce5">Errors</h3>
<div class="outline-text-3" id="text-orge467ce5">
</div>
<div id="outline-container-org3c1d2b4" class="outline-4">
<h4 id="org3c1d2b4">Relative erros in double precision</h4>
<div class="outline-text-4" id="text-org3c1d2b4">
<ul class="org-ul">
<li>Upper bound of relative erross: <i>(</i> 2^{-(m+1)} ) where <i>m</i> is the signficand bits</li>
<li>For relative precision (double) <i>m</i> = 52</li>
<li><p>
The relative error of double precision is
</p>
\begin{equation}

\end{equation}</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org25b7d41" class="outline-2">
<h2 id="org25b7d41">Lecture 3 9-04 | Numerical Precision and Relatove Error Cont.</h2>
<div class="outline-text-2" id="text-org25b7d41">
</div>
<div id="outline-container-org718822a" class="outline-3">
<h3 id="org718822a">Quick notes:</h3>
<div class="outline-text-3" id="text-org718822a">
<ul class="org-ul">
<li>For the mastery assignements there will be no test cases to check like with the learning asssignments</li>
<li>However, there will be a google collab file that will help you test and debug</li>
<li>Unlimited submissions just like learning assignment</li>
</ul>
</div>
</div>
<div id="outline-container-orga6a3ad0" class="outline-3">
<h3 id="orga6a3ad0">Precision errors with quadratic equation</h3>
<div class="outline-text-3" id="text-orga6a3ad0">
<ul class="org-ul">
<li>The challange: (/ | 4b_{2}b_{0} | &lt;&lt; b^{2}_{2} /)</li>
<li>Not accurate in terms in relative error in some cases</li>
</ul>
</div>
</div>
<div id="outline-container-orga387233" class="outline-3">
<h3 id="orga387233">West Algorithm</h3>
<div class="outline-text-3" id="text-orga387233">
</div>
<div id="outline-container-org7020a57" class="outline-4">
<h4 id="org7020a57">Algorithms (def)</h4>
<div class="outline-text-4" id="text-org7020a57">
<ul class="org-ul">
<li>loose definition: a sequence of well-defined computational steps</li>
<li>takes a set of values</li>
<li>produces a set of values</li>
</ul>
</div>
</div>
<div id="outline-container-org2ad2145" class="outline-4">
<h4 id="org2ad2145">Key features of a good algorithm</h4>
<div class="outline-text-4" id="text-org2ad2145">
<ul class="org-ul">
<li>Correctness</li>
<li>Efficiency</li>
<li>Simplicity</li>
</ul>

<p>
<b>*</b>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orge255f80" class="outline-2">
<h2 id="orge255f80">Lecture 4 9-09 | Divide &amp; Conquer</h2>
<div class="outline-text-2" id="text-orge255f80">
</div>
<div id="outline-container-org675b65f" class="outline-3">
<h3 id="org675b65f">Time Complexity</h3>
<div class="outline-text-3" id="text-org675b65f">
<ul class="org-ul">
<li>Why is it important?
<ul class="org-ul">
<li>Suppose that I have an algoroithm that takes 1 second for n=1000 sample size</li>
<li>If the algorithm has linear time complexity&#x2026;.
<ul class="org-ul">
<li>1 million, 17 minutes</li>
<li>1 billion, 12 days&#x2026;.</li>
</ul></li>
<li>If the algorithm has quadratic time complexity&#x2026;
<ul class="org-ul">
<li>50000 samples, 42 minutes</li>
<li>1 million samples, 12 days</li>
<li>1 billion, 31000 years</li>
</ul></li>
<li>In log time complexity&#x2026;
<ul class="org-ul">
<li>For 1 billion samples, 20 seconds</li>
</ul></li>
</ul></li>

<li>Big O notation (upper bounded)
<ul class="org-ul">
<li>This is what we care abou the most&#x2026; worst case performance</li>
</ul></li>
<li>Big Omega notation (lower bounded)</li>
<li>Big Theta notation (tight bound)
<ul class="org-ul">
<li>For most of this class, we will use Big Theta notation</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1bc18ff" class="outline-3">
<h3 id="org1bc18ff">Recursion</h3>
<div class="outline-text-3" id="text-org1bc18ff">
<ul class="org-ul">
<li>Key components
<ul class="org-ul">
<li>A function that is part of its own definition</li>
<li>Terminating condition</li>
</ul></li>

<li>Tower of Hanoi</li>
</ul>
</div>
</div>
<div id="outline-container-org17e4b13" class="outline-3">
<h3 id="org17e4b13">Divide and Conquer Algorithm</h3>
<div class="outline-text-3" id="text-org17e4b13">
<ul class="org-ul">
<li>Solve a problem recursively, applying three steps at each level of recursion

<ol class="org-ol">
<li><b>Divide</b>: the problem into a number of subproblems that are smaller instances of the same problem</li>
<li><b>Conquer</b>: the subproblems by solving them recursively. If the subproblem sizes are small enough, however, just solve the problems in a straightforward manner</li>
<li><b>Combine</b>: the solutions to subproblems into the solution for the original problem</li>
</ol></li>
</ul>
</div>
<div id="outline-container-org95b9cf3" class="outline-4">
<h4 id="org95b9cf3">Insertion Sort</h4>
<div class="outline-text-4" id="text-org95b9cf3">
<ul class="org-ul">
<li>For k-th step, assume that elements a[1], &#x2026; , a[k-1] are already sorted in order.</li>
<li>Locate a[k] between index 1, &#x2026; ,k so that all a[1], &#x2026;, a[k] are in order</li>
<li>Move the focus to k+1-th element and repeat the same step</li>
</ul>
</div>
</div>
