notes.org
*** Merge Sort

- Concept behind merge sort is relatively simple
- Keep splitting the array into halves until each subarray is size 1
- Then recursively merge two subarrays at a time
- Time complexity: *O(nlogn)*

Two functions are needed to accomplish this
#+begin_src R
#' merge() : merge two sorted vectors in O(n)
#' @param a - A sorted numeric vector
#' @param b - Another sorted numeric vector
#' @return A sorted vector merging a and b
merge = function(a,b) {
    r = numeric(length(a)+length(b)) # make an empty vector
    i=1; j=1 # i and j are indices for a and b
    for(k in 1:length(r)) {
      ## if b is used up or a[i] < b[j], copy from a
      if ( ( j > length(b) ) || ( i <= length(a) && a[i]<b[j] ) ) {
        r[k] = a[i]
        i = i + 1
      } else {  ## otherwise, copy from b
        r[k] = b[j]
        j = j + 1
      }
    }
    return(r) ## return the merged vector
}

#' mergeSort() : sort an array in O(n log n)
#' @param x A unsorted numeric vector
#' @return A sorted version of x
mergeSort = function(x) {
    if(length(x)>1) {   ## if the element size is greater than 1, keep dividing
        mid = ceiling(length(x)/2)          # find the midpoint
        a = mergeSort(x[1:mid])             # divide - part 1
        b = mergeSort(x[(mid+1):length(x)]) # divide - part 2
        return( merge(a,b) )                # combine the sorted solutions - to me implemented
    } else {  # terminating condition - only 1 element left
        return (x)
    }
}
#+end_src

- most of the lower level languages are using quick sort


* Lecture 5 | Matrix Computation

** Algorithms for matrix computation

- Why do matrices matter?
  - Many statistical models can be represented as matrices
  - Efficeient matric computation can make a difference in the practicality of a method
  - Understanding R implementation of matrix operation can expedite the efficiency by orders of magnitude

- Time compexity is not everything
  - Explains how scalable the algorithm is relative to the increase in the size of input data
  - The *absolute* computational time on an algorithm may depend on the implementation details
  - For example, using a loop inside of R is not usually recommended... slows down implementation by quite a bit

* Lecture 6 | Matrix Computation cont.

** BLAS/LAPACK

- BLAS: implements low-level routines for linear algebra
- LAPACK: implements key algorithms for linear algebra such as matrix decomposition and linear systems solver
- Why are they so fast?

  1. Vectorization
  2. Multithreading
  3. Cache Optimization

- Important to be able to recognize when matrix multiplication is computationally expensive
- ORDER MATTERS!

** Quadratic multiplication

- Consider computing $x'Ax$ where $A=LL'$ (Cholesky decomposition)
- $u=L'x$ can be computed more efficiently than $Ax$
- $x'Ax=u'u$

** Matrix decompisition and solving linear systems

* Assignments:

** Learning Ex. 1:

- `intToBits()` converts to 64-bit by default AND in reversed order. In order to complete this task we need to reverse the order of the vector and remove every even element.
- This can be completed to satisfaction with brute force by following this logic:
  - Check if passed-value is an integer, check if passed-value is numeric (numeric values are 64-bit in base R), check if passed-value is within the bounds of a 32-bit integer value. IF any of these conditions are met, then we want the function to return NA. Otherwise...
  - Convert to bits -> collapse vector into str -> re-vectorize with each int as its own index -> reverse the vector -> remove the even elements -> collapse vector into string again.
- That said, we want to find a more efficient way to solve this.
- R base has only one numeric (float) type which is 64 bit.

** Code

#+BEGIN_SRC R
int2BinaryStr <- function(n) {
  if (!is.numeric(n) || floor(n) != n || n < -2^31 || n > 2^31 - 1) {
    return(NA)
  }

  binary_str <- past(rev(as.integer(intToBits(as.integer(n)))), collaple=""")

  return(binary_str)
}
#+END_SRC

*** Code Breakdown
- r{!is.numeric(n)}: checking if number is not a numeric. Base R treats numeric values as 64-bit
- r{floor(n) != n}: checking if n is not an integer
- r{n < -2^32 || n > 2^31}: checks if n is within the range of 32-bit integer values


** Learning Ex. 2:

** Code
