notes.html
<div id="outline-container-orgfcfc130" class="outline-4">
<h4 id="orgfcfc130">Merge Sort</h4>
<div class="outline-text-4" id="text-orgfcfc130">
<ul class="org-ul">
<li>Concept behind merge sort is relatively simple</li>
<li>Keep splitting the array into halves until each subarray is size 1</li>
<li>Then recursively merge two subarrays at a time</li>
<li>Time complexity: <b>O(nlogn)</b></li>
</ul>

<p>
Two functions are needed to accomplish this
</p>
<div class="org-src-container">
<pre class="src src-R"><span style="color: #606580; font-weight: bold;">#</span><span style="color: #606580; font-weight: bold;">'</span><span style="color: #606580;"> merge() : merge two sorted vectors in O(n)</span>
<span style="color: #606580; font-weight: bold;">#</span><span style="color: #606580; font-weight: bold;">'</span><span style="color: #606580;"> </span><span style="color: #ffb86c;">@param</span><span style="color: #606580;"> </span><span style="color: #ff5c57;">a</span><span style="color: #606580;"> - A sorted numeric vector</span>
<span style="color: #606580; font-weight: bold;">#</span><span style="color: #606580; font-weight: bold;">'</span><span style="color: #606580;"> </span><span style="color: #ffb86c;">@param</span><span style="color: #606580;"> </span><span style="color: #ff5c57;">b</span><span style="color: #606580;"> - Another sorted numeric vector</span>
<span style="color: #606580; font-weight: bold;">#</span><span style="color: #606580; font-weight: bold;">'</span><span style="color: #606580;"> </span><span style="color: #ffb86c;">@return</span><span style="color: #606580;"> A sorted vector merging a and b</span>
merge = <span style="color: #ffb86c;">function</span>(a,b) {
    r = numeric(length(a)+length(b)) <span style="color: #606580;"># </span><span style="color: #606580;">make an empty vector</span>
    i=<span style="color: #f3f99d; font-weight: bold;">1</span>; j=<span style="color: #f3f99d; font-weight: bold;">1</span> <span style="color: #606580;"># </span><span style="color: #606580;">i and j are indices for a and b</span>
    <span style="color: #ffb86c;">for</span>(k <span style="color: #ffb86c;">in</span> <span style="color: #f3f99d; font-weight: bold;">1</span>:length(r)) {
      <span style="color: #606580;">## </span><span style="color: #606580;">if b is used up or a[i] &lt; b[j], copy from a</span>
      <span style="color: #ffb86c;">if</span> ( ( j &gt; length(b) ) || ( i &lt;= length(a) &amp;&amp; a[i]&lt;b[j] ) ) {
        r[k] = a[i]
        i = i + <span style="color: #f3f99d; font-weight: bold;">1</span>
      } <span style="color: #ffb86c;">else</span> {  <span style="color: #606580;">## </span><span style="color: #606580;">otherwise, copy from b</span>
        r[k] = b[j]
        j = j + <span style="color: #f3f99d; font-weight: bold;">1</span>
      }
    }
    <span style="color: #ffb86c;">return</span>(r) <span style="color: #606580;">## </span><span style="color: #606580;">return the merged vector</span>
}

<span style="color: #606580; font-weight: bold;">#</span><span style="color: #606580; font-weight: bold;">'</span><span style="color: #606580;"> mergeSort() : sort an array in O(n log n)</span>
<span style="color: #606580; font-weight: bold;">#</span><span style="color: #606580; font-weight: bold;">'</span><span style="color: #606580;"> </span><span style="color: #ffb86c;">@param</span><span style="color: #606580;"> </span><span style="color: #ff5c57;">x</span><span style="color: #606580;"> A unsorted numeric vector</span>
<span style="color: #606580; font-weight: bold;">#</span><span style="color: #606580; font-weight: bold;">'</span><span style="color: #606580;"> </span><span style="color: #ffb86c;">@return</span><span style="color: #606580;"> A sorted version of x</span>
mergeSort = <span style="color: #ffb86c;">function</span>(x) {
    <span style="color: #ffb86c;">if</span>(length(x)&gt;<span style="color: #f3f99d; font-weight: bold;">1</span>) {   <span style="color: #606580;">## </span><span style="color: #606580;">if the element size is greater than 1, keep dividing</span>
        mid = ceiling(length(x)/<span style="color: #f3f99d; font-weight: bold;">2</span>)          <span style="color: #606580;"># </span><span style="color: #606580;">find the midpoint</span>
        a = mergeSort(x[<span style="color: #f3f99d; font-weight: bold;">1</span>:mid])             <span style="color: #606580;"># </span><span style="color: #606580;">divide - part 1</span>
        b = mergeSort(x[(mid+<span style="color: #f3f99d; font-weight: bold;">1</span>):length(x)]) <span style="color: #606580;"># </span><span style="color: #606580;">divide - part 2</span>
        <span style="color: #ffb86c;">return</span>( merge(a,b) )                <span style="color: #606580;"># </span><span style="color: #606580;">combine the sorted solutions - to me implemented</span>
    } <span style="color: #ffb86c;">else</span> {  <span style="color: #606580;"># </span><span style="color: #606580;">terminating condition - only 1 element left</span>
        <span style="color: #ffb86c;">return</span> (x)
    }
}
</pre>
</div>

<ul class="org-ul">
<li>most of the lower level languages are using quick sort</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org66dfc21" class="outline-2">
<h2 id="org66dfc21">Lecture 5 | Matrix Computation</h2>
<div class="outline-text-2" id="text-org66dfc21">
</div>
<div id="outline-container-orgb2d42b8" class="outline-3">
<h3 id="orgb2d42b8">Algorithms for matrix computation</h3>
<div class="outline-text-3" id="text-orgb2d42b8">
<ul class="org-ul">
<li>Why do matrices matter?
<ul class="org-ul">
<li>Many statistical models can be represented as matrices</li>
<li>Efficeient matric computation can make a difference in the practicality of a method</li>
<li>Understanding R implementation of matrix operation can expedite the efficiency by orders of magnitude</li>
</ul></li>

<li>Time compexity is not everything
<ul class="org-ul">
<li>Explains how scalable the algorithm is relative to the increase in the size of input data</li>
<li>The <b>absolute</b> computational time on an algorithm may depend on the implementation details</li>
<li>For example, using a loop inside of R is not usually recommended&#x2026; slows down implementation by quite a bit</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf12643c" class="outline-2">
<h2 id="orgf12643c">Lecture 6 | Matrix Computation cont.</h2>
<div class="outline-text-2" id="text-orgf12643c">
</div>
<div id="outline-container-orgf6100b3" class="outline-3">
<h3 id="orgf6100b3">BLAS/LAPACK</h3>
<div class="outline-text-3" id="text-orgf6100b3">
<ul class="org-ul">
<li>BLAS: implements low-level routines for linear algebra</li>
<li>LAPACK: implements key algorithms for linear algebra such as matrix decomposition and linear systems solver</li>
<li>Why are they so fast?

<ol class="org-ol">
<li>Vectorization</li>
<li>Multithreading</li>
<li>Cache Optimization</li>
</ol></li>

<li>Important to be able to recognize when matrix multiplication is computationally expensive</li>
<li>ORDER MATTERS!</li>
</ul>
</div>
</div>
<div id="outline-container-org905da41" class="outline-3">
<h3 id="org905da41">Quadratic multiplication</h3>
<div class="outline-text-3" id="text-org905da41">
<ul class="org-ul">
<li>Consider computing \(x'Ax\) where \(A=LL'\) (Cholesky decomposition)</li>
<li>\(u=L'x\) can be computed more efficiently than \(Ax\)</li>
<li>\(x'Ax=u'u\)</li>
</ul>
</div>
</div>
<div id="outline-container-org5202d6e" class="outline-3">
<h3 id="org5202d6e">Matrix decompisition and solving linear systems</h3>
</div>
</div>
<div id="outline-container-orgce65f82" class="outline-2">
<h2 id="orgce65f82">Assignments:</h2>
<div class="outline-text-2" id="text-orgce65f82">
</div>
<div id="outline-container-orgbc2d9cd" class="outline-3">
<h3 id="orgbc2d9cd">Learning Ex. 1:</h3>
<div class="outline-text-3" id="text-orgbc2d9cd">
<ul class="org-ul">
<li>`intToBits()` converts to 64-bit by default AND in reversed order. In order to complete this task we need to reverse the order of the vector and remove every even element.</li>
<li>This can be completed to satisfaction with brute force by following this logic:
<ul class="org-ul">
<li>Check if passed-value is an integer, check if passed-value is numeric (numeric values are 64-bit in base R), check if passed-value is within the bounds of a 32-bit integer value. IF any of these conditions are met, then we want the function to return NA. Otherwise&#x2026;</li>
<li>Convert to bits -&gt; collapse vector into str -&gt; re-vectorize with each int as its own index -&gt; reverse the vector -&gt; remove the even elements -&gt; collapse vector into string again.</li>
</ul></li>
<li>That said, we want to find a more efficient way to solve this.</li>
<li>R base has only one numeric (float) type which is 64 bit.</li>
</ul>
</div>
</div>
<div id="outline-container-org6566acb" class="outline-3">
<h3 id="org6566acb">Code</h3>
<div class="outline-text-3" id="text-org6566acb">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #57c7ff;">int2BinaryStr</span> <span style="color: #5af78e;">&lt;-</span> <span style="color: #ffb86c;">function</span>(n) {
  <span style="color: #ffb86c;">if</span> (!is.numeric(n) || floor(n) != n || n &lt; -<span style="color: #f3f99d; font-weight: bold;">2</span>^<span style="color: #f3f99d; font-weight: bold;">31</span> || n &gt; <span style="color: #f3f99d; font-weight: bold;">2</span>^<span style="color: #f3f99d; font-weight: bold;">31</span> - <span style="color: #f3f99d; font-weight: bold;">1</span>) {
    <span style="color: #ffb86c;">return</span>(<span style="color: #9aedfe;">NA</span>)
  }

  binary_str <span style="color: #5af78e;">&lt;-</span> past(rev(as.integer(intToBits(as.integer(n)))), collaple=<span style="color: #f3f99d;">""")</span>

<span style="color: #f3f99d;">  return(binary_str)</span>
<span style="color: #f3f99d;">}</span>
</pre>
</div>
</div>
<div id="outline-container-orgde865a4" class="outline-4">
<h4 id="orgde865a4">Code Breakdown</h4>
<div class="outline-text-4" id="text-orgde865a4">
<ul class="org-ul">
<li>r{!is.numeric(n)}: checking if number is not a numeric. Base R treats numeric values as 64-bit</li>
<li>r{floor(n) != n}: checking if n is not an integer</li>
<li>r{n &lt; -2^32 || n &gt; 2^31}: checks if n is within the range of 32-bit integer values</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org09de879" class="outline-3">
<h3 id="org09de879">Learning Ex. 2:</h3>
</div>

<div id="outline-container-orgd81c1a9" class="outline-3">
<h3 id="orgd81c1a9">Code</h3>
</div>
</div>
</div>
</body>
</html>
